#ifndef __RDA5807_H__
#define __RDA5807_H__
/****************************************************************************
 * Included Files
 ****************************************************************************/
#include <stdbool.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/ 
/*50K步进*/
//#define	_FM_STEP_50K_

/****************************************************************************
 * Public Types
 ****************************************************************************/
 
/****************************************************************************
 * Public Data
 ****************************************************************************/
 
/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/
 
/****************************************************************************
 * Public Functions
 ****************************************************************************/
/****************************************************************************
 * Name: rda5807_init
 *
 * Description:
 *    向FM收音IC发送初始化信号
 *
 * Parameters:
 *
 * Returned Value:
 *    true发送成功，false发送失败
 *
 * Assumptions:
 *
 ****************************************************************************/
bool rda5807_init(void);

/****************************************************************************
 * Name: rda5807_init_iic
 *
 * Description:
 *    与FM收音IC通信的IO口初始化
 *
 * Parameters:
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
void rda5807_init_iic(void);

/****************************************************************************
 * Name: rda5807_power_on
 *
 * Description:
 *    向FM收音IC发送开机信号
 *
 * Parameters:
 *
 * Returned Value:
 *    true发送成功，false发送失败
 *
 * Assumptions:
 *
 ****************************************************************************/
bool rda5807_power_on(void);

/****************************************************************************
 * Name: rda5807_set_freq
 *
 * Description:
 *    设置RDA5807的频率
 *
 * Parameters:
 *    freq 要设置的频率
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
bool rda5807_set_freq(unsigned short freq);

/****************************************************************************
 * Name: rda5807_reset
 *
 * Description:
 *    向FM收音IC发送复位信号
 *
 * Parameters:
 *
 * Returned Value:
 *    true发送成功，false发送失败
 *
 * Assumptions:
 *
 ****************************************************************************/
bool rda5807_reset(void);

/****************************************************************************
 * Name: rda5807_read
 *
 * Description:
 *    从FM收音IC读取指定长度数据
 *
 * Parameters:
 *    buf 缓存的区
 *    length 数据长度
 *
 * Returned Value:
 *    true读取成功，false读取失败
 *  
 * Assumptions:
 *
 ****************************************************************************/
bool rda5807_read(unsigned char* buf, int length);

/****************************************************************************
 * Name: rda5807_write
 *
 * Description:
 *    向RDA5807写入命令
 *
 * Parameters:
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
bool rda5807_write(const unsigned char *cmds, int length);
unsigned short rda5807_read_reg(unsigned char reg);
bool rda5807_write_reg(unsigned char reg, unsigned short data);
unsigned short rda5807_read_chipid(void);
void rda5807_mute(void);
void rda5807_unmute(void);


#endif
