#ifndef SL_UI_LOCAL_H__
#define SL_UI_LOCAL_H__

extern int folder_index_tab[255][2];
extern int folder_total_num;



//#include <sys/types.h>
/****************************************************************************
 * Included Files
 ****************************************************************************/

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: get_file_total
 *
 * Description:
 *    获取播放列表的总文件数
 *
 * Parameters:
 *
 * Returned Value:
 * 	  总的文件数
 *
 * Assumptions:
 *
 ****************************************************************************/
int get_file_total(void);

/****************************************************************************
 * Name: file_load_thread
 *
 * Description:
 *    文件加载线程入口
 *
 * Parameters:
 *    arg 要加载的文件的路径
 *
 * Returned Value:
 * 	  0-成为，非0-失败
 *
 * Assumptions:
 *
 ****************************************************************************/
int file_load_thread(pthread_addr_t arg);

/****************************************************************************
 * Name: handle_local
 *
 * Description:
 *    本地播放处理，启动线程加载文件列表
 *
 * Parameters:
 *    local_media 搜索的本地媒体路径
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
void handle_local(const char* local_media);

/****************************************************************************
 * Name: handle_local_music_play
 *
 * Description:
 *    启动播放
 *
 * Parameters:
 *    file_index 要播放的文件序号
 *    playtime 播放位置
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
void handle_local_music_play(int file_index, int playtime);

/****************************************************************************
 * Name: reset_playlist
 *
 * Description:
 *    初始化播放列表
 *
 * Parameters:
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
void reset_playlist(void);

/****************************************************************************
 * Name: time2str
 *
 * Description:
 *    音乐时间转字符串
 *
 * Parameters:
 *    curtime 当前时间
 *    totaltime 总时间
 *    str 接收转换后的字符串
 *
 * Returned Value:
 *
 * Assumptions:
 *
 ****************************************************************************/
void time2str(int curtime, int totaltime, char *str);
#endif
